Revit 2024 API
DuctFittingAndAccessoryConnectorData Class
 The input data used by external servers for calculation of the duct fitting and duct accessory coefficient.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class DuctFittingAndAccessoryConnectorData : IDisposable
Visual Basic
Public Class DuctFittingAndAccessoryConnectorData _
	Implements IDisposable
Visual C++
public ref class DuctFittingAndAccessoryConnectorData : IDisposable
Remarks
 width, height, diameter, flow, velocity pressure and connector index are input data for the calculation,
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData
See Also
DuctFittingAndAccessoryConnectorData Members
Autodesk.Revit.DB.Mechanical Namespace